function EG_1()

    tic


    function ret = Rx(a)
        ret = [1,    0,        0;
             0,   cos(a), -sin(a);
             0,   sin(a),  cos(a)];
    end

    function ret = Ry(a)
        ret = [cos(a),    0,        sin(a);
             0,         1,        0;
             -sin(a),   0,        cos(a)];
    end

    function ret = Rz(a)
        ret = [cos(a),    -sin(a),        0;
               sin(a),     cos(a),        0;
                    0,          0,        1];
    end

    function ret = Rotm(v,q)
        
        ret = [cos(q)+(1-cos(q))*(v(1)^2), (1-cos(q))*v(1)*v(2)-sin(q)*v(3), (1-cos(q))*v(1)*v(3)+sin(q)*v(2);
                (1-cos(q))*v(2)*v(1)+sin(q)*v(3), cos(q)+(1-cos(q))*(v(2)^2), (1-cos(q))*v(2)*v(3)-sin(q)*v(1);
                (1-cos(q))*v(3)*v(1)-sin(q)*v(2),   (1-cos(q))*v(3)*v(2)+sin(q)*v(1), cos(q)+(1-cos(q))*(v(3)^2)];
    end

    L0 = 0.4;
    L1 = 0.2215;  L2 = L1;
    L3 = 0.270;  L4 = L3;
    L5 = 0.420;   L6 = L5;
    L7 = 0.475;  L8 = L7;
    L9 = 0.227;   L10 = L9;
    L11 = 0.160;   L12 = L11;

  
    

M = [ 15;   % M(1)  %% спина
      3;    % M(2)  
      3;    % M(3)
      12;   % M(4)  %% бедро
      12;   % M(5)  %% бедро
      7;    % M(6)  %% голень
      7;    % M(7)  %% голень

     ];
  

   q = sym('q', [16, 1]);assume(q,'real');

    % обобщенные координаты правой ноги
% q(1) 
% q(3) 
% q(5) 
% q(7) 
% q(9) 

    % обобщенные координаты левой ноги
% q(2) 
% q(4) 
% q(6) 
% q(8) 
% q(10)

    % спина
% q(11) - поворот на месте
% q(12) - наклон набок 
% q(13) - наклон вперед/назад

    % положение локальной системы координат
% q(14) q(15) q(16)


    T_0 = Rx(q(13))*Ry(q(12))*Rz(q(11));
    r0 = -L0*T_0(:,3) + [q(14) q(15) q(16)]';
    
    r1 = L1*T_0(:,1) + r0;
    r2 = -L2*T_0(:,1) + r0;
    
    r3 = L3*T_0(:,2) + r1;
    r4 = L4*T_0(:,2) + r2;
    

    T_3_5 = Rotm( T_0(:,2), q(1) )*Rotm( T_0(:,1), q(3) ) * T_0;
    T_4_6 = Rotm( T_0(:,2), q(2) )*Rotm( T_0(:,1), q(4) ) * T_0;
    r5 =  -L5*T_3_5(:,3) + r3;
    r6 =  -L6*T_4_6(:,3) + r4;      

    
    T_5_7 = Rotm( T_3_5(:,1) , q(5) )*T_3_5;
    T_6_8 = Rotm( T_4_6(:,1) , q(6) )*T_4_6;
    r7 = -L7*T_5_7(:,3) + r5;
    r8 = -L8*T_6_8(:,3) + r6;

    
    q(7) = -q(13) + q(7);
    q(8) = -q(13) + q(8);
    T_7_9 = Rotm( T_5_7(:,1) , q(7) ) * T_5_7;
    T_8_10 = Rotm( T_6_8(:,1) , q(8) ) * T_6_8;
    r9 = L9*T_7_9(:,2) + r7;
    r10 = L10*T_8_10(:,2) + r8;

    
    
    q(9) = q(12) + q(9);
    q(10) = q(12) + q(10);
    T_7_11 = Rotm( T_7_9(:,2) , q(9) ) * T_7_9;
    T_8_12 = Rotm( T_8_10(:,2) , q(10) ) * T_8_10;
    r11 = -L11*T_7_11(:,1) + r7;
    r12 = L12*T_8_12(:,1) + r8;

    
%     r13 = r7 + ( (r9-r7) + (r11-r7) ); 
%     r14 = r8 + ( (r10-r8) + (r12-r8) );     
    
    rC_9_11 = (r9 + r11) / 2;
    rC_10_12 = (r10 + r12) / 2;

%     C0 = (O2+O1)/2;
%     C1 = (O3+O1)/2;
%     C2 = (O4+O2)/2;
%     C3 = (O5+O3)/2;
%     C4 = (O6+O4)/2;
%     C5 = (O7+O5)/2;   
%     C6 = (O8+O6)/2;
    
%     C = (C0*M(1) + C1*M(2) + C2*M(3) + C3*M(4) + C4*M(5) + C5*M(6) + C6*M(7))/sum(M);
%     C = simplify(C);
    
    
    
    F = [r0; r3; r4; rC_9_11; rC_10_12];
    F = simplify(F);
    J = jacobian(F, q);
    J = simplify(J);
    
    
    
    matlabFunction(F,'File','f','Vars', {q});
    matlabFunction(J,'File','jac','Vars', {q});

    toc
    
end





