    function Solver()
    
    clear;
    clc;
    close all;

    
    global graph;
    global g_t;
    g_t = 1;
    graph = [];

    q1 = 0;
    q2 = 0;
    q3 = -8 * (pi/180);
    q4 = -8 * (pi/180);
    q5 = -12 * (pi/180);
    q6 = -12 * (pi/180);

    x = 1;
    y = 1;
    z = 1;
    q10 = 0;
    q11 = 0;
    q12 = 0;
    

    dt = 0.01;
    
    q_0 = [q1 q2 q3 q4 q5 q6 x y z q10 q11 q12]';                                                                                            
    q = q_0;
    
    s = f(q);      % получаем текущее положение контролируемых точек
    newton_euler_iterations = 2;     
        %%%%%%%%%%%%%%%%%%%%
tic;    % Simulation start %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   
                                          % 1 %
                                          %%%%%
                                    % Наклон вправо %
                                    %%%%%%%%%%%%%%%%%
   
      for t = 0:dt:pi/2

        s(1) = s(1) - 0.007*atan(t); 
        s(2) = s(2) + 0.001*atan(t); 
        s(3) = s(3) - 0.00055*atan(t);
        
%         s(5) = s(5) + 0.0030155*atan(10*t); 
%         s(6) = s(6) + 0.0000155*atan(10*t); 
        %pinv(jac(q)) * (s - f(q))
        for i=1:newton_euler_iterations
            
%              q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

     end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%d%%%%%%%%%%%%%%%%%
                                        % 2 %
                                        %%%%%
                        % Переваливание вперед и подъем ноги %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %{
    for t = 0:dt:pi/2

%         s(1) = s(1) - 0.01*sin(2*t); 
        s(2) = s(2) + 0.008*atan(t);
        s(3) = s(3) + 0.00085*atan(t);

        
        s(5) = s(5) + 0.02*atan(t);      
        s(6) = s(6) + 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations
%              q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 3 %
                                        %%%%%
                        % Переваливание вперед и опускание ноги %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
  
% %{
    for t = 0:dt:pi/2

%         s(1) = s(1) - 0.01*sin(2*t); 
         s(2) = s(2) + 0.001*atan(t);
          s(3) = s(3) - 0.001*atan(10*t);
        
         s(5) = s(5) + 0.0047*atan(t);      
        s(6) = s(6) - 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations
%              q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 4 %
                                        %%%%%
                                % Переваливание набок %
                                %%%%%%%%%%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

         s(1) = s(1) + 0.014*atan(t); 
          s(2) = s(2) + 0.012*atan(t);
          s(3) = s(3) - 0.0012*atan(10*t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations

%             q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 5 %
                                        %%%%%
                                    % Длинный шаг %
                                    %%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

%          s(1) = s(1) + 0.014*atan(t); 
          s(2) = s(2) + 0.011*atan(t);
          s(3) = s(3) + 0.0055*atan(t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);

        s(8) = s(8) +  0.05*atan(t); 
        s(9) = s(9) +  0.002*atan(10*t);
        for i=1:newton_euler_iterations

%             q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 6 %
                                        %%%%%
                        % Опускание ноги после длинного шага %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

%          s(1) = s(1) + 0.014*atan(t); 
          s(2) = s(2) + 0.010*atan(t);
          s(3) = s(3) - 0.003*atan(t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);

        s(8) = s(8) +  0.005*atan(t); 
        s(9) = s(9) -  0.002*atan(10*t);
        for i=1:newton_euler_iterations

%             q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 6 %
                                        %%%%%
                                % Переваливание набок %
                                %%%%%%%%%%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

         s(1) = s(1) - 0.014*atan(t); 
          s(2) = s(2) + 0.008*atan(t);
           s(3) = s(3) - 0.0012*atan(10*t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);

%         s(5) = s(5) +  0.05*atan(t); 
%         s(6) = s(6) +  0.002*atan(10*t);
        for i=1:newton_euler_iterations

%             q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 7 %
                                        %%%%%
                                    % Длинный шаг %
                                    %%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

%          s(1) = s(1) + 0.014*atan(t); 
          s(2) = s(2) + 0.011*atan(t);
          s(3) = s(3) + 0.0055*atan(t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);

        s(5) = s(5) +  0.05*atan(t); 
        s(6) = s(6) +  0.002*atan(10*t);
        for i=1:newton_euler_iterations

             q = q + pinv(jac(q)) * (s - f(q));
%                 q = q + lsqminnorm( jac(q), (s - f(q)) );
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 8 %
                                        %%%%%
                        % Опускание ноги после длинного шага %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% %{
    for t = 0:dt:pi/2

%          s(1) = s(1) + 0.014*atan(t); 
          s(2) = s(2) + 0.010*atan(t);
          s(3) = s(3) - 0.003*atan(t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);

        s(5) = s(5) +  0.005*atan(t); 
        s(6) = s(6) -  0.002*atan(10*t);
        for i=1:newton_euler_iterations

             q = q + pinv(jac(q)) * (s - f(q)); 
%                 q = q + lsqminnorm( jac(q), (s - f(q)) );             

        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 9 %
                                        %%%%%
                                % Переваливание набок %
                                %%%%%%%%%%%%%%%%%%%%%%%
% % {
    for t = 0:dt:pi/2

          s(1) = s(1) + 0.0137*atan(t); 
          s(2) = s(2) + 0.0043*atan(t);
          s(3) = s(3) - 0.001*atan(10*t);
        
%          s(5) = s(5) + 0.004*atan(t);      
%         s(6) = s(6) - 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations

%             q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%




%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 10 %
                                        %%%%%
                        % Переваливание вперед и подъем ноги %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %{
    for t = 0:dt:pi/2

%         s(1) = s(1) - 0.01*sin(2*t); 
        s(2) = s(2) + 0.011*atan(t)
        s(3) = s(3) + 0.003*atan(t);

        
        s(8) = s(8) + 0.02*atan(t);      
        s(9) = s(9) + 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations
%            q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                        % 11 %
                                        %%%%%%
                                    % Опускание ноги %
                                    %%%%%%%%%%%%%%%%%%

% %{
    for t = 0:dt:pi/2

        s(1) = s(1) - 0.007*sin(2*t); 
        s(2) = s(2) - 0.0015*atan(t);
%          s(3) = s(3) + 0.001*atan(t);

        s(8) = s(8) + 0.0047*atan(t);         
        s(9) = s(9) - 0.002*atan(10*t);
        
        for i=1:newton_euler_iterations
%            q = q + lsqminnorm( jac(q), (s - f(q)) );
             q = q + pinv(jac(q)) * (s - f(q)); 
             
        end
        graph(g_t) = q(3);
        g_t = g_t+1;
        Animation(q,0);

    end
%}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 


    Animation(q,1);
     
    
     toc;  

end


















































